In [3]:
#Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.
import pandas as pd

data = [4, 8, 15, 16, 23, 42]

df = pd.Series(data)
df

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

In [4]:
#Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the variable print it.
import pandas as pd

data = [1,2,3,4,5,5,6,6,7,9]

df = pd.Series(data)
df

0    1
1    2
2    3
3    4
4    5
5    5
6    6
7    6
8    7
9    9
dtype: int64

In [5]:
#Q3. Create a Pandas DataFrame that contains the following data.Then, print the DataFrame.

import pandas as pd

data = {
    "Name" : ["Alice", "Bob", "Claire"],
    "Age" : [25,30,27],
    "Gender" : ["Female", "Male", "Female"]
}

df = pd.DataFrame(data)
df

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [7]:
#Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.
'''
In pandas, a DataFrame is a 2-dimensional labeled data structure with columns of potentially different data types. 
It can be thought of as a collection of Series objects that share the same index. 

A Series, on the other hand, is a one-dimensional labeled array capable of holding any data type.
'''

import pandas as pd

name = pd.Series(["Alice", "Bob", "Claire"])

data = {
    "Name" : ["Alice", "Bob", "Claire"],
    "Age" : [25,30,27],
    "Gender" : ["Female", "Male", "Female"]
}

df = pd.DataFrame(data)

print("Pandas Series: \n")
print(name)
print("\n")

print("Pandas DataFrame: \n")
print(df)

Pandas Series:

0     Alice
1       Bob
2    Claire
dtype: object


Pandas DataFrame:

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [8]:
#Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? 
#Can you give an example of when you might use one of these functions?
'''
Pandas provides a rich set of functions for manipulating data in a DataFrame. Here are some common functions and their uses:

1. head() and tail()
2. info()
3. describe()
4. drop()
5. sort_values()
6. groupby()
7. pivot_table()
8. map() 
'''

df = pd.read_csv("dataset.csv")
df.head()

,years_of_experience,functional_competency_score,top1_skills_score,top2_skills_score,top3_skills_score,behavior_competency_score,top1_behavior_skill_score,top2_behavior_skill_score,top3_behavior_skill_score,call_for_interview
0,0.333333,0.749498,0.777778,0.7,0.8,0.769231,0.931689,0.662042,0.752463,1
1,0.133333,0.490638,0.777778,0.3,0.4,0.153846,0.352093,0.132231,0.316905,0
2,0.000000,0.460256,0.444444,0.3,0.3,0.051282,0.052347,0.089765,0.254859,0
3,0.000000,0.507347,0.555556,0.4,0.5,0.384615,0.309913,0.289758,0.440784,0
4,0.400000,0.662020,0.666667,0.7,0.5,0.461538,0.497929,0.397544,0.392760,1

In [ ]:
#Q6. Which of the following is mutable in nature Series, DataFrame, Panel?
'''
Both Series and DataFrame are mutable in nature, meaning that their values can be modified after they have been created.
'''

In [9]:
#Q7. Create a DataFrame using multiple Series. Explain with an example.
'''
To create a DataFrame using multiple Series, we can pass a dictionary where each key corresponds to a column name, 
and each value is a Series object with the data for that column.
'''
import pandas as pd

names = pd.Series(['Alice', 'Bob', 'Claire'])
ages = pd.Series([25, 30, 27])
genders = pd.Series(['Female', 'Male', 'Female'])

df = pd.DataFrame({'Name': names, 'Age': ages, 'Gender': genders})
print(df)

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female